Revit 2027 API
PostPattern.EndPost Property
 Accesses the object containing properties related to the end post.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BalusterInfo EndPost { get; }
Public ReadOnly Property EndPost As BalusterInfo
	Get
public:
property BalusterInfo^ EndPost {
	BalusterInfo^ get ();
}
member EndPost : BalusterInfo with get
Property Value
BalusterInfo
See Also
Reference
PostPattern Class
Autodesk.Revit.DB.Architecture Namespace